Rails/blog/app/controllers/posts_controller.rb

	def create
		@post = Post.new(post_params)

		if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

	def update
		@post = Post.find(params[:id])

		if @post.update(params[:post].permit(:title, :body))
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = 3  [["title", "This is an updated post!"], ["updated_at", "2015-01-26 19:02:24.708936"]]